-- 1. Да се създаде листинг на имената на всички отдели в банката

SELECT dep_name FROM DEPARTMENT;

-- 2. Да се създаде листинга на месечните възнаграждения на всички
-- служители, в листинга е необходимо да присъстват двете имена
-- на служителя и неговата заплата

SELECT (first_name || last_name) as "Names", salary as "Salary" from employee;

-- 3. Да се създаде листинг на всички служители в банката в листинга
-- трябва да присъстват двете имена на служителите и новогенерирани
-- имейли, които да се състоят от конкатенирани първото и второ име
-- на служителя разделени с точка. Имената на служителите трябва да
-- бъдат с малки букви в имейла. Домейна на компанията е
-- bankoftomorrow.bg

SELECT (first_name || last_name) as "Names", (fist_name || '.' || last_name || '@bankoftomorrow.bg') as "EMail" from employee;

-- 4. Намерете всички служители които банката дефинира като старши
-- служители. Старши служители са всички които работят в компанията
-- от 5 години.



-- 5. Намерете всички служители, чиито имена (първо / второ или
-- допълнително съдържат буквата l)